tests/fixtures/sapo/draft-orders/single.json

{
  "draft_order": {
    "id": 6586400,
    "location_id": null,
    "user_id": null,
    "assignee_id": null,
    "source_name": null,
    "note": null,
    "currency": "VND",
    "created_on": "2026-04-29T19:06:59Z",
    "modified_on": "2026-04-29T19:06:59Z",
    "name": "***",
    "status": "open",
    "order_id": null,
    "tags": "",
    "email": null,
    "phone": null,
    "completed_on": null,
    "copy_order_id": null,
    "total_discounts": 0.0,
    "total_shipping_price": 0.0,
    "total_line_items_price": 150000.0,
    "line_items_subtotal_price": 150000.0,
    "total_tax": 0.0,
    "subtotal_price": 150000.0,
    "total_price": 150000.0,
    "taxes_included": false,
    "tax_exempt": false,
    "grams": 100.0,
    "billing_address": null,
    "shipping_address": null,
    "applied_discount": null,
    "shipping_line": null,
    "line_items": [
      {
        "variant_id": 147237422,
        "inventory_item_id": 147237420,
        "product_id": 46419129,
        "title": "Sữa tắm Dove",
        "variant_title": null,
        "sku": "SKU30",
        "vendor": null,
        "price": 150000,
        "price_override": null,
        "quantity": 1,
        "requires_shipping": true,
        "fulfillment_service": "manual",
        "grams": 100,
        "applied_discount": null,
        "name": "***",
        "properties": [],
        "tax_lines": [],
        "custom": false,
        "taxable": false,
        "lot_management": false,
        "discounted_total": 150000,
        "discounted_unit_price": 150000,
        "total_original": 150000,
        "token": "833f024c-225b-4aa2-a569-2ac3ae1884a9",
        "inventory_policy": "deny",
        "inventory_management": "bizweb",
        "discount_allocations": [],
        "components": [],
        "type": "normal",
        "unit": null,
        "item_unit": null,
        "image": null,
        "catalog_id": null,
        "note": null,
        "total_discount": 0
      }
    ],
    "note_attributes": [],
    "customer": null,
    "discount_applications": [],
    "referring_site": null,
    "source_url": null,
    "applied_discounts": [],
    "discount_codes": [],
    "discount_violations": [],
    "shipping_lines": [],
    "automatic_discounts_override": false,
    "expected_payment_method_id": null,
    "customer_group_id": null,
    "invoices": [],
    "shipment_category": null,
    "shipment_deadline": null,
    "processed_on": null,
    "expected_delivery_date": null,
    "channel_definition": null,
    "tax_lines": []
  }
}
